In [1]:
import pandas as pd
import sqlalchemy as sa
import psycopg2 as ps
from sqlalchemy import create_engine

In [2]:
%load_ext sql
%sql postgresql://postgres:lingga28@localhost:2828/datacamp
conn = create_engine('postgresql://postgres:lingga28@localhost/datacamp')

# 1. Often rented movies
### Exercises
Your manager wants you to make a list of movies excluding those which are hardly ever watched. This list of movies will be used for advertising. List all movies with more than 5 views using a nested query which is a powerful tool to implement selection conditions.

### task 1
### Instruction
Select all movie IDs which have more than 5 views.

In [3]:
%%sql

SELECT movie_id -- Select movie IDs with more than 5 views
FROM renting
GROUP BY movie_id
HAVING COUNT(movie_id) > 5
LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[(54,), (29,), (71,), (68,), (4,), (34,), (51,), (70,), (52,), (67,)]

### task 2
### Instruction
Select all information about movies with more than 5 views.

In [4]:
%%sql

SELECT *
FROM movies
WHERE movie_id IN   -- Select movie IDs from the inner query
	(SELECT movie_id
	FROM renting
	GROUP BY movie_id
	HAVING COUNT(*) > 5)
    LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[(1, "One Night at McCool's", 'Comedy', 93, 2001, Decimal('2.09')),
 (2, 'Swordfish', 'Drama', 99, 2001, Decimal('2.19')),
 (3, 'What Women Want', 'Comedy', 127, 2001, Decimal('2.59')),
 (4, 'Training Day', 'Drama', 122, 2001, Decimal('1.79')),
 (5, 'The Fellowship of the Ring', 'Science Fiction & Fantasy', 178, 2001, Decimal('2.59')),
 (6, "Harry Potter and the Philosopher's Stone", 'Science Fiction & Fantasy', 152, 2001, Decimal('2.69')),
 (7, 'The Royal Tenenbaums', 'Comedy', 110, 2002, Decimal('1.89')),
 (10, 'Simone', 'Drama', 117, 2002, Decimal('2.69')),
 (11, 'Showtime', 'Comedy', 95, 2002, Decimal('1.79')),
 (12, 'The Two Towers', 'Science Fiction & Fantasy', 179, 2002, Decimal('2.39'))]

# 2. Frequent customers
### Exercises
Report a list of customers who frequently rent movies on MovieNow.

### Instruction
List all customer information for customers who rented more than 10 movies.

In [5]:
%%sql

SELECT *
FROM customers
WHERE customer_id IN            -- Select all customers with more than 10 movie rentals
	(SELECT customer_id
	FROM renting
	GROUP BY customer_id
	HAVING COUNT(*) > 10);

 * postgresql://postgres:***@localhost:2828/datacamp
6 rows affected.

[(21, 'Avelaine Corbeil', 'France', 'female', datetime.date(1986, 3, 17), datetime.date(2017, 6, 11)),
 (28, 'Sidney Généreux', 'France', 'male', datetime.date(1980, 12, 1), datetime.date(2017, 2, 4)),
 (49, 'Havasy Kristof', 'Hungary', 'male', datetime.date(1998, 6, 13), datetime.date(2017, 1, 18)),
 (92, 'Honorata Nowak', 'Poland', 'female', datetime.date(1986, 5, 2), datetime.date(2017, 9, 21)),
 (113, 'Lucy Centeno Barrios', 'Spain', 'female', datetime.date(1970, 11, 3), datetime.date(2017, 6, 13)),
 (114, 'Canela Gaona Lozano', 'Spain', 'female', datetime.date(1997, 4, 1), datetime.date(2017, 2, 14))]

# 3. Movies with rating above average
### Exercises
For the advertising campaign your manager also needs a list of popular movies with high ratings. Report a list of movies with rating above average.

### task 1
### Instruction
Calculate the average over all ratings.

In [6]:
%%sql

SELECT AVG(rating) -- Calculate the total average rating
FROM renting;

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(Decimal('7.9390243902439024'),)]

### task 2
### Instruction
Select movie IDs and calculate the average rating of movies with rating above average.

In [8]:
%%sql

SELECT movie_id, -- Select movie IDs and calculate the average rating 
       AVG(rating)
FROM renting
GROUP BY movie_id
HAVING AVG(rating) >     -- Of movies with rating above average
	(SELECT AVG(rating)
	FROM renting)
    LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[(54, Decimal('8.1666666666666667')),
 (29, Decimal('8.0000000000000000')),
 (71, Decimal('8.0000000000000000')),
 (34, Decimal('8.0000000000000000')),
 (51, Decimal('8.4285714285714286')),
 (63, Decimal('9.3333333333333333')),
 (35, Decimal('8.0000000000000000')),
 (6, Decimal('8.8000000000000000')),
 (39, Decimal('8.0000000000000000')),
 (50, Decimal('8.0000000000000000'))]

### task 3
### Instruction
The advertising team only wants a list of movie titles. Report the movie titles of all movies with average rating higher than the total average.

In [9]:
%%sql

SELECT title -- Report the movie titles of all movies with average rating higher than the total average
FROM movies
WHERE movie_id IN
	(SELECT movie_id
	 FROM renting
     GROUP BY movie_id
     HAVING AVG(rating) > 
		(SELECT AVG(rating)
		 FROM renting))
    LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[('What Women Want',),
 ('The Fellowship of the Ring',),
 ("Harry Potter and the Philosopher's Stone",),
 ('The Royal Tenenbaums',),
 ('Waking Up in Reno',),
 ("11'09''01 September 11",),
 ('Harry Potter and the Chamber of Secrets',),
 ('25th Hour',),
 ('The Human Stain',),
 ('Secondhand Lions',)]

# 4. Analyzing customer behavior
### Exercises
A new advertising campaign is going to focus on customers who rented fewer than 5 movies. Use a correlated query to extract all customer information for the customers of interest.

### task 1
### Instruction
First, count number of movie rentals for customer with customer_id=45. Give the table renting the alias r.

In [10]:
%%sql

 -- Count movie rentals of customer 45
SELECT COUNT(movie_id)
FROM renting
WHERE customer_id=45;

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(5,)]

### task 2
### Instruction
Now select all columns from the customer table where the number of movie rentals is smaller than 5.

In [11]:
%%sql

-- Select customers with less than 5 movie rentals
SELECT *
FROM customers as c
WHERE 5 > 
	(SELECT count(*)
	FROM renting as r
	WHERE r.customer_id = c.customer_id)
    LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[(2, 'Wolfgang Ackermann', 'Austria', 'male', datetime.date(1971, 11, 17), datetime.date(2018, 10, 15)),
 (3, 'Daniela Herzog', 'Austria', 'female', datetime.date(1974, 8, 7), datetime.date(2019, 2, 14)),
 (4, 'Julia Jung', 'Austria', 'female', datetime.date(1991, 1, 4), datetime.date(2017, 11, 22)),
 (5, 'Juliane Kirsch', 'Austria', 'female', datetime.date(1977, 3, 1), datetime.date(2018, 12, 16)),
 (6, 'Rowanne Couperus', 'Belgium', 'female', datetime.date(1994, 4, 5), datetime.date(2018, 8, 26)),
 (9, 'Antal van Looij', 'Belgium', 'male', datetime.date(1982, 6, 18), datetime.date(2019, 3, 10)),
 (11, 'Yakup Mes', 'Belgium', 'male', datetime.date(1978, 4, 28), datetime.date(2019, 2, 19)),
 (12, 'Kristine J. Lauritsen', 'Denmark', 'female', datetime.date(1994, 1, 14), datetime.date(2018, 12, 2)),
 (14, 'Niels M. Holm', 'Denmark', 'male', datetime.date(1991, 12, 29), datetime.date(2018, 1, 26)),
 (15, 'Jasmin M. Krogh', 'Denmark', 'female', datetime.date(1977, 11, 12), datetime.date(2018, 6, 20))]

# 5. Customers who gave low ratings
### Exercises
Identify customers who were not satisfied with movies they watched on MovieNow. Report a list of customers with minimum rating smaller than 4.

### task 1
### Instruction
Calculate the minimum rating of customer with ID 7.

In [12]:
%%sql

-- Calculate the minimum rating of customer with ID 7
SELECT MIN(rating)
FROM renting
WHERE customer_id = 7;

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(8,)]

### task 2
### Instruction
Select all customers with a minimum rating smaller than 4. Use the first letter of the table as an alias.

In [13]:
%%sql

SELECT *
FROM customers AS c
WHERE 4 > -- Select all customers with a minimum rating smaller than 4 
	(SELECT MIN(rating)
	FROM renting AS r
	WHERE r.customer_id = c.customer_id);

 * postgresql://postgres:***@localhost:2828/datacamp
4 rows affected.

[(28, 'Sidney Généreux', 'France', 'male', datetime.date(1980, 12, 1), datetime.date(2017, 2, 4)),
 (41, 'Zara Mitchell', 'Great Britan', 'female', datetime.date(1994, 7, 8), datetime.date(2017, 6, 12)),
 (86, 'Albin Jaworski', 'Poland', 'male', datetime.date(1984, 5, 1), datetime.date(2017, 12, 15)),
 (120, 'Robin J. Himes', 'USA', 'male', datetime.date(1988, 11, 30), datetime.date(2018, 8, 6))]

# 6. Movies and ratings with correlated queries
Report a list of movies that received the most attention on the movie platform, (i.e. report all movies with more than 5 ratings and all movies with an average rating higher than 8).

### task 1
### Instruction
Select all movies with more than 5 ratings. Use the first letter of the table as an alias.

In [15]:
%%sql

SELECT *
FROM movies AS m
WHERE 5 < -- Select all movies with more than 5 ratings
	(SELECT COUNT(r.rating)
	FROM renting AS r
	WHERE r.movie_id = m.movie_id)
    LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[(4, 'Training Day', 'Drama', 122, 2001, Decimal('1.79')),
 (10, 'Simone', 'Drama', 117, 2002, Decimal('2.69')),
 (12, 'The Two Towers', 'Science Fiction & Fantasy', 179, 2002, Decimal('2.39')),
 (14, 'The Recruit', 'Mystery & Suspense', 115, 2003, Decimal('1.69')),
 (22, 'Imagining Argentina', 'Art House & International', 107, 2004, Decimal('2.59')),
 (23, 'Shall We Dance', 'Drama', 106, 2004, Decimal('1.69')),
 (25, 'Bridget Jones - The Edge of Reason', 'Drama', 108, 2004, Decimal('2.89')),
 (27, 'Monster', 'Drama', 109, 2004, Decimal('2.09')),
 (28, 'Harry Potter and the Prisoner of Azkaban', 'Science Fiction & Fantasy', 142, 2004, Decimal('1.69')),
 (29, 'Two for the Money', 'Drama', 122, 2005, Decimal('2.79'))]

### task 2
### Instruction
Select all movies with an average rating higher than 8.

In [16]:
%%sql

SELECT *
FROM movies AS m
WHERE 8 < -- Select all movies with an average rating higher than 8
	(SELECT AVG(r.rating)
	FROM renting AS r
	WHERE r.movie_id = m.movie_id)
    LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[(3, 'What Women Want', 'Comedy', 127, 2001, Decimal('2.59')),
 (5, 'The Fellowship of the Ring', 'Science Fiction & Fantasy', 178, 2001, Decimal('2.59')),
 (6, "Harry Potter and the Philosopher's Stone", 'Science Fiction & Fantasy', 152, 2001, Decimal('2.69')),
 (9, "11'09''01 September 11", 'Drama', 134, 2002, Decimal('2.99')),
 (16, '25th Hour', 'Drama', 135, 2003, Decimal('1.59')),
 (18, 'Secondhand Lions', 'Drama', 111, 2003, Decimal('1.69')),
 (22, 'Imagining Argentina', 'Art House & International', 107, 2004, Decimal('2.59')),
 (24, 'Welcome to Mooseport', 'Comedy', 110, 2004, Decimal('2.89')),
 (26, 'Ray', 'Drama', 152, 2004, Decimal('2.59')),
 (27, 'Monster', 'Drama', 109, 2004, Decimal('2.09'))]

# 7. Customers with at least one rating
### Exercises
Having active customers is a key performance indicator for MovieNow. Make a list of customers who gave at least one rating.

### task 1
### Instruction
Select all records of movie rentals from customer with ID 115.

In [17]:
%%sql

-- Select all records of movie rentals from customer with ID 115
SELECT *
FROM renting
WHERE customer_id = '115';

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[(245, 115, 69, None, datetime.date(2019, 4, 24)),
 (395, 115, 11, None, datetime.date(2019, 4, 7)),
 (498, 115, 42, None, datetime.date(2019, 3, 16))]

### task 2
### Instruction
Select all records of movie rentals from the customer with ID 115 and exclude records with null ratings.

In [21]:
%%sql

SELECT *
FROM renting
WHERE rating IS NOT NULL -- Exclude those with null ratings
AND customer_id = 115

 * postgresql://postgres:***@localhost:2828/datacamp
0 rows affected.

[]

### task 3
### Instruction
Select all records of movie rentals from the customer with ID 1, excluding null ratings.

In [19]:
%%sql

SELECT *
FROM renting
WHERE rating IS NOT NULL -- Exclude null ratings
AND customer_id = 1; -- Select all ratings from customer with ID 1

 * postgresql://postgres:***@localhost:2828/datacamp
2 rows affected.

[(421, 1, 71, 10, datetime.date(2019, 1, 21)),
 (520, 1, 39, 6, datetime.date(2018, 12, 29))]

### task 4
### Instruction
Select all customers with at least one rating. Use the first letter of the table as an alias.

In [20]:
%%sql

SELECT *
FROM customers AS c -- Select all customers with at least one rating
WHERE EXISTS
	(SELECT *
	FROM renting AS r
	WHERE rating IS NOT NULL 
	AND r.customer_id = c.customer_id)
    LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[(2, 'Wolfgang Ackermann', 'Austria', 'male', datetime.date(1971, 11, 17), datetime.date(2018, 10, 15)),
 (4, 'Julia Jung', 'Austria', 'female', datetime.date(1991, 1, 4), datetime.date(2017, 11, 22)),
 (7, 'Annelous Sneep', 'Belgium', 'female', datetime.date(1993, 11, 14), datetime.date(2018, 5, 12)),
 (8, 'Jaëla van den Dolder', 'Belgium', 'female', datetime.date(1990, 8, 31), datetime.date(2018, 2, 8)),
 (10, 'Arnout Veenhuis', 'Belgium', 'male', datetime.date(1984, 7, 26), datetime.date(2017, 1, 28)),
 (11, 'Yakup Mes', 'Belgium', 'male', datetime.date(1978, 4, 28), datetime.date(2019, 2, 19)),
 (12, 'Kristine J. Lauritsen', 'Denmark', 'female', datetime.date(1994, 1, 14), datetime.date(2018, 12, 2)),
 (13, 'Thomas T. Nissen', 'Denmark', 'male', datetime.date(1975, 9, 25), datetime.date(2017, 4, 30)),
 (14, 'Niels M. Holm', 'Denmark', 'male', datetime.date(1991, 12, 29), datetime.date(2018, 1, 26)),
 (15, 'Jasmin M. Krogh', 'Denmark', 'female', datetime.date(1977, 11, 12), datetime.date(2018, 6, 20))]

# 8. Actors in comedies
### Exercises
In order to analyze the diversity of actors in comedies, first, report a list of actors who play in comedies and then, the number of actors for each nationality playing in comedies.

### task 1
### Instruction
Select the records of all actors who play in a Comedy. Use the first letter of the table as an alias.

In [22]:
%%sql

SELECT *  -- Select the records of all actors who play in a Comedy
FROM actsin AS ai
LEFT JOIN movies AS m
ON ai.movie_id = m.movie_id
WHERE m.genre = 'Comedy'
LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[(2, 56, 2, 56, 'Jack and Jill', 'Comedy', 91, 2011, Decimal('2.09')),
 (6, 56, 3, 56, 'Jack and Jill', 'Comedy', 91, 2011, Decimal('2.09')),
 (9, 7, 6, 7, 'The Royal Tenenbaums', 'Comedy', 110, 2002, Decimal('1.89')),
 (17, 20, 14, 20, 'Love Actually', 'Comedy', 135, 2003, Decimal('2.29')),
 (28, 8, 23, 8, 'Waking Up in Reno', 'Comedy', 91, 2002, Decimal('2.59')),
 (52, 15, 34, 15, "Something's Gotta Give", 'Comedy', 128, 2003, Decimal('1.69')),
 (53, 51, 34, 51, 'Morning Glory', 'Comedy', 107, 2010, Decimal('2.99')),
 (55, 11, 36, 11, 'Showtime', 'Comedy', 95, 2002, Decimal('1.79')),
 (75, 15, 45, 15, "Something's Gotta Give", 'Comedy', 128, 2003, Decimal('1.69')),
 (77, 7, 47, 7, 'The Royal Tenenbaums', 'Comedy', 110, 2002, Decimal('1.89'))]

### task 2
### Instruction
Make a table of the records of actors who play in a Comedy and select only the actor with ID 1.

In [25]:
%%sql

SELECT *
FROM actsin AS ai
LEFT JOIN movies AS m
ON m.movie_id = ai.movie_id
WHERE m.genre = 'Comedy'
AND ai.actor_id = 1; -- Select only the actor with ID

 * postgresql://postgres:***@localhost:2828/datacamp
0 rows affected.

[]

### task 3
### Instruction
Create a list of all actors who play in a Comedy. Use the first letter of the table as an alias.

In [26]:
%%sql

SELECT *
FROM actors AS a
WHERE EXISTS
	(SELECT *
	 FROM actsin AS ai
	 LEFT JOIN movies AS m
	 ON m.movie_id = ai.movie_id
	 WHERE m.genre = 'Comedy'
	 AND ai.actor_id = a.actor_id)
    LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[(2, 'Adam Sandler', 1966, 'USA', 'male'),
 (3, 'Al Pacino', 1940, 'USA', 'male'),
 (6, 'Anjelica Huston', 1951, 'USA', 'female'),
 (14, 'Bill Nighy', 1949, 'British', 'male'),
 (23, 'Charlize Theron', 1975, 'South Africa', 'female'),
 (34, 'Diane Keaton', 1946, 'USA', 'female'),
 (36, 'Eddie Murphy', 1961, 'USA', 'male'),
 (45, 'Frances McDormand', 1957, 'USA', 'female'),
 (47, 'Gene Hackman', 1930, 'USA', 'male'),
 (50, 'Gwyneth Paltrow', 1972, 'USA', 'female')]

### task 4
### Instruction
Report the nationality and the number of actors for each nationality.

In [27]:
%%sql

SELECT a.nationality,  -- Report the nationality and number of actors for each nationality
COUNT(*) 
FROM actors AS a
WHERE EXISTS
	(SELECT ai.actor_id
	 FROM actsin AS ai
	 LEFT JOIN movies AS m
	 ON m.movie_id = ai.movie_id
	 WHERE m.genre = 'Comedy'
	 AND ai.actor_id = a.actor_id)
GROUP BY a.nationality;

 * postgresql://postgres:***@localhost:2828/datacamp
5 rows affected.

[('Northern Ireland', 1),
 ('USA', 22),
 ('South Africa', 1),
 ('Canada', 1),
 ('British', 3)]

# 9. Young actors not coming from the USA
### Exercises
As you've just seen, the operators UNION and INTERSECT are powerful tools when you work with two or more tables. Identify actors who are not from the USA and actors who were born after 1990.

### task 1
### Instruction
Report the name, nationality and the year of birth of all actors who are not from the USA.

In [28]:
%%sql

SELECT name,  -- Report the name, nationality and the year of birth
       nationality, 
       year_of_birth
FROM actors
WHERE nationality != 'USA' -- Of all actors who are not from the USA
LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[('Abbie Cornish', 'Australia', 1982),
 ('Andrea Riseborough', 'British', 1981),
 ('Anthony Hopkins', 'British', 1937),
 ('Barkhad Abdi', 'Somalia', 1985),
 ('Barry Pepper', 'Canada', 1970),
 ('Benicio Del Toro', 'Puerto Rico', 1967),
 ('Bill Nighy', 'British', 1949),
 ('Carice van Houten', 'Netherlands', 1976),
 ('Cate Blanchett', 'Australia', 1969),
 ('Charlize Theron', 'South Africa', 1975)]

### task 2
### Instruction
Report the name, nationality and the year of birth of all actors who were born after 1990.

In [29]:
%%sql

SELECT name, 
       nationality, 
       year_of_birth
FROM actors
WHERE year_of_birth > 1990; -- Born after 1990

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('Annasophia Robb', 'USA', 1993),
 ('Freddie Highmore', 'British', 1992),
 ('Josh Hutcherson', 'USA', 1992)]

### task 3
### Instruction
Select all actors who are not from the USA and all actors who are born after 1990.

In [30]:
%%sql

SELECT name, 
       nationality, 
       year_of_birth
FROM actors
WHERE nationality <> 'USA'
UNION -- Select all actors who are not from the USA and all actors who are born after 1990
SELECT name, 
       nationality, 
       year_of_birth
FROM actors
WHERE year_of_birth > 1990
LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[('Cate Blanchett', 'Australia', 1969),
 ('Julie Christie', 'British', 1940),
 ('Emma Watson', 'British', 1990),
 ('Sean Bean', 'British', 1959),
 ('Freddie Highmore', 'British', 1992),
 ('Eddie Redmayne', 'British', 1982),
 ('Ian McKellen', 'British', 1939),
 ('Colin Firth', 'British', 1960),
 ('Tom Wilkinson', 'British', 1948),
 ('Keanu Reeves', 'Canada', 1964)]

### task 4
### Instruction
Select all actors who are not from the USA and who are also born after 1990.

In [31]:
%%sql

SELECT name, 
       nationality, 
       year_of_birth
FROM actors
WHERE nationality <> 'USA'
INTERSECT -- Select all actors who are not from the USA and who are also born after 1990
SELECT name, 
       nationality, 
       year_of_birth
FROM actors
WHERE year_of_birth > 1990;

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[('Freddie Highmore', 'British', 1992)]

# 10. Dramas with high ratings
### Exercises
The advertising team has a new focus. They want to draw the attention of the customers to dramas. Make a list of all movies that are in the drama genre and have an average rating higher than 9.

### task 1
### Instruction
Select the IDs of all dramas.

In [32]:
%%sql

SELECT * -- Select the IDs of all dramas
FROM movies
WHERE genre='Drama'
LIMIT 10; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[(2, 'Swordfish', 'Drama', 99, 2001, Decimal('2.19')),
 (4, 'Training Day', 'Drama', 122, 2001, Decimal('1.79')),
 (9, "11'09''01 September 11", 'Drama', 134, 2002, Decimal('2.99')),
 (10, 'Simone', 'Drama', 117, 2002, Decimal('2.69')),
 (16, '25th Hour', 'Drama', 135, 2003, Decimal('1.59')),
 (18, 'Secondhand Lions', 'Drama', 111, 2003, Decimal('1.69')),
 (19, '21 Grams', 'Drama', 124, 2003, Decimal('2.09')),
 (23, 'Shall We Dance', 'Drama', 106, 2004, Decimal('1.69')),
 (25, 'Bridget Jones - The Edge of Reason', 'Drama', 108, 2004, Decimal('2.89')),
 (26, 'Ray', 'Drama', 152, 2004, Decimal('2.59'))]

### task 2
### Instruction
Select the IDs of all movies with average rating higher than 9

In [33]:
%%sql

SELECT movie_id, AVG(rating) -- Select the IDs of all movies with average rating higher than 9
FROM renting
GROUP BY movie_id
HAVING AVG(rating) > 9;

 * postgresql://postgres:***@localhost:2828/datacamp
4 rows affected.

[(63, Decimal('9.3333333333333333')),
 (42, Decimal('9.6000000000000000')),
 (48, Decimal('10.0000000000000000')),
 (5, Decimal('9.7500000000000000'))]

### task 3
### Instruction
Select the IDs of all dramas with average rating higher than 9.

In [34]:
%%sql

SELECT movie_id
FROM movies
WHERE genre = 'Drama'
INTERSECT  -- Select the IDs of all dramas with average rating higher than 9
SELECT movie_id
FROM renting
GROUP BY movie_id
HAVING AVG(rating)>9;

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(42,)]

### task 4
### Instruction
Select all movies of in the drama genre with an average rating higher than 9.

In [36]:
%%sql

SELECT *
FROM movies
WHERE movie_id IN  -- Select all movies of genre drama with average rating higher than 9
   (SELECT movie_id
    FROM movies
    WHERE genre = 'Drama'
    INTERSECT
    SELECT movie_id
    FROM renting
    GROUP BY movie_id
    HAVING AVG(rating)>9);

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(42, 'No Country for Old Men', 'Drama', 122, 2007, Decimal('1.49'))]